Конфигурация/Documents/ПриходТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриходТовара</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРозничнаяТекущая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРозничнаяНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/ПриходТовара/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// 1. Получаем данные товара с сервера (Наценка)
	ДанныеТовара = ПолучитьДанныеНоменклатуры(ТекущиеДанные.Номенклатура);
	
	// 2. Рассчитываем цену, если есть цена закупки
	Если ТекущиеДанные.Цена > 0 Тогда
		РассчитатьРозничнуюЦену(ТекущиеДанные, ДанныеТовара.ПроцентНаценки);
	КонецЕсли;
	
	// 3. Заполняем текущую розничную для сравнения
	ТекущиеДанные.ЦенаРозничнаяТекущая = ДанныеТовара.ЦенаТекущая;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Пересчитываем сумму строки (стандартная логика)
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	
	// 1. Получаем % наценки (чтобы не дергать сервер лишний раз, можно кэшировать, но пока так)
	ДанныеТовара = ПолучитьДанныеНоменклатуры(ТекущиеДанные.Номенклатура);
	
	// 2. Рассчитываем новую розницу
	РассчитатьРозничнуюЦену(ТекущиеДанные, ДанныеТовара.ПроцентНаценки);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьРозничнуюЦену(СтрокаТЧ, ПроцентНаценки)
	
	Если ПроцентНаценки = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Формула: Закупка * (1 + % / 100)
	РасчетнаяЦена = СтрокаТЧ.Цена * (1 + ПроцентНаценки / 100);
	
	// Округление (получаем метод округления с сервера один раз при открытии или каждый раз)
	// Для оптимизации вызовем серверную функцию без контекста
	Порядок = ПолучитьПорядокОкругления();
	
	СтрокаТЧ.ЦенаРозничнаяНовая = ОкруглитьЦену(РасчетнаяЦена, Порядок);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатуры(НоменклатураСсылка)
	
	Результ = Новый Структура("ПроцентНаценки, ЦенаТекущая");
	Результ.ПроцентНаценки = 0;
	Результ.ЦенаТекущая = 0;
	
	Если НоменклатураСсылка.Пустая() Тогда
		Возврат Результ;
	КонецЕсли;
	
	// Читаем наценку из справочника
	Результ.ПроцентНаценки = НоменклатураСсылка.ПроцентНаценки;
	
	// Читаем текущую цену из регистра сведений
	Отбор = Новый Структура("Номенклатура", НоменклатураСсылка);
	Цены = РегистрыСведений.ЦеныНоменклатуры.ПолучитьПоследнее(ТекущаяДата(), Отбор);
	Результ.ЦенаТекущая = Цены.Цена;
	
	Возврат Результ;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьПорядокОкругления()
	// Читаем константу
	Возврат НастройкиПоУмолчанию.ПолучитьПорядокОкругленияЦен();
КонецФункции

&НаКлиенте
Функция ОкруглитьЦену(Цена, Порядок)
	
	Если Порядок = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияЦен.Окр001") Тогда
		Возврат Окр(Цена, 2);
	ИначеЕсли Порядок = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияЦен.Окр010") Тогда
		Возврат Окр(Цена / 0.1, 0, РежимОкругления.Окр15как20) * 0.1;
	ИначеЕсли Порядок = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияЦен.Окр050") Тогда
		Возврат Окр(Цена / 0.5, 0, РежимОкругления.Окр15как20) * 0.5;
	ИначеЕсли Порядок = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияЦен.Окр100") Тогда
		Возврат Окр(Цена, 0, РежимОкругления.Окр15как20);
	ИначеЕсли Порядок = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияЦен.ОкрВБольшую") Тогда
		Возврат Цел(Цена) + ?(Цена = Цел(Цена), 0, 1);
	КонецЕсли;
	
	Возврат Цена;
	
КонецФункции
